{
  "descriptions":{
    "description":[
      {
        "id":"installedCapacity",
        "p":[
          "The max capacity of the structure (MWS) supported by the devices and allowed by the national regulation agency. [sko] issue: MWS vs. PWPS in case of diversity."
        ]
      },
      {
        "id":"uuid",
        "count":3,
        "p":[
          "UUID: An identifier that is universally unique",
          "(consider in the context of Identifier: A property of an entity/role with a value that is unique within an identifier space, where the identifier space is itself globally unique, and immutable. An identifier carries no semantics with respect to the purpose or state of the entity)",
          "The UUID for the UUID authority.",
          "The UUID for the NameValueAuthority."
        ]
      },
      {
        "id":"LayerProtocol",
        "count":1,
        "p":[
          "Each transport layer is represented by a LayerProtocol (LP) instance. The LayerProtocol instances it can be used for controlling termination and monitoring functionality. ",
          "It can also be used for controlling the adaptation (i.e. encapsulation and/or multiplexing of client signal), tandem connection monitoring, traffic conditioning and/or shaping functionality at an intermediate point along a connection. ",
          "Where the client – server relationship is fixed 1:1 and immutable, the layers can be encapsulated in a single LTP instance. Where the is a n:1 relationship between client and server, the layers must be split over two separate instances of LTP. "
        ]
      },
      {
        "id":"LogicalTerminationPoint",
        "count":1,
        "p":[
          "The LogicalTerminationPoint (LTP) object class encapsulates the termination and adaptation functions of one or more transport layers. ",
          "The structure of LTP supports all transport protocols including circuit and packet forms."
        ]
      },
      {
        "id":"NetworkElement",
        "count":1,
        "p":[
          "The Network Element (NE) object class represents a network element (traditional NE) in the data plane.",
          "A data plane network element is essentially a consolidation of capabilities that can be viewed and controlled through a 'single' management-control port.",
          "In the direct interface from an SDN controller to a network element in the data plane, the NetworkElement object defines the scope of control for the resources within the network element",
          "For example internal transfer of user information between the external terminations (ports of the NE), encapsulation, multiplexing/demultiplexing, and OAM functions, etc. ",
          "The NetworkElement provides the scope of the naming space for identifying objects representing the resources within the data plane network element.",
          "NE is really a product bundling or some view of management scope, management access, session. ",
          "The NE is not directly part of topology but brings meaning to the FD context and the LTP context (and hence the links). "
        ]
      },
      {
        "id":"totalNumberOfTimeSlots",
        "count":1,
        "p":[
          "Maximum number of time slots available with the current configuration of the air interface (means e.g. that AirInterface::AirInterfaceStatus::modulationCur is equal to AirInterface::AirInterfaceConfiguration::modulationMax)."
        ]
      },
      {
        "id":"tdmTimeSlotsIsSupported",
        "count":1,
        "p":[
          "In case the microwave radio is capable of transporting TDM, this field shall contain an '1'."
        ]
      },
      {
        "id":"StructureConfiguration",
        "count":1,
        "p":[
          "Basic principles for defining the Default values of Configuration attributes:",
          "- NO Default values for attributes that MUST be configured by the controller\/operator while starting the device.",
          "- Default values for every attribute that might be configured also at a later stage.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Configuration messages provided by the device shall contain the current configuration."
        ]
      },
      {
        "id":"tdmReservedNumberOfTimeSlots",
        "count":1,
        "p":[
          "Allows to configure the number of time slots reserved for TDM traffic."
        ]
      },
      {
        "id":"serverID",
        "count":1,
        "p":[
          "Identifies the physical resource, on which the structure is imprinted on.",
          "Can be filled with either an airInterfaceID, an airInterfaceHsbID or an airInterfaceDiversityID."
        ]
      },
      {
        "id":"StructureStatus",
        "count":1,
        "p":[
          "Basic principles for defining the Defaults values of Status attributes:",
          "- Every attribute shall have a Default value.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Status messages provided by the device shall either contain actual status information or if not possible these default values."
        ]
      },
      {
        "id":"timeSlotStatusList",
        "count":2,
        "p":[
          "Condition of each time slot.",
          "_multiplicity:Structure::StructureCapability::totalNumberOfTimeSlots"
        ]
      },
      {
        "id":"StructureHistoricalPerformance",
        "count":1,
        "p":[
          "Basic principles for defining the Defaults values of Performance attributes:",
          "- Every attribute shall have a Default value.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"MW_Container_Pac",
        "count":1,
        "p":[
          "LTP(Client)"
        ]
      },
      {
        "id":"ContainerCapability",
        "count":1,
        "p":[
          "Basic principles for defining the Default values of Capability attributes:",
          "- NO Default values for attributes that MUST be delivered from the device.",
          "- Default values for every attribute that might be delivered.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"containerID",
        "count":1,
        "p":[
          "ContainterID in Netconf must be the same as EthernetPortID in OpenFlow so a connection can be made between the two items, which are existing separately in the controller."
        ]
      },
      {
        "id":"availableKindsOfContainerList",
        "count":1,
        "p":[
          "Available container types to be listed."
        ]
      },
      {
        "id":"priorityClassesIsAvail",
        "count":1,
        "p":[
          "Shall be marked '1', if the device is capable of assigning different priorities to containers and adapting the sequence, in which time slots are being dropped in case of decreasing capacity of the air interface."
        ]
      },
      {
        "id":"encryptionIsAvail",
        "count":1,
        "p":[
          "Shall be marked '1', if payload encryption is available."
        ]
      },
      {
        "id":"packetCompressionIsAvail",
        "count":1,
        "p":[
          "In case packet compression can be activated, but not configured to a certain type, packetCompressionAvail shall be set to \"1\", but none of the type specific booleans."
        ]
      },
      {
        "id":"layer2CompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on layer 2 available at the device."
        ]
      },
      {
        "id":"vlanCompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on VLAN layer available at the device."
        ]
      },
      {
        "id":"qInQCompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on layer of a second VLAN available at the device."
        ]
      },
      {
        "id":"mplsCompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on mpls layer available at the device."
        ]
      },
      {
        "id":"l2vpnCompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on level of layer 2 VPN available at the device."
        ]
      },
      {
        "id":"ipv4CompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on layer 3 for IPv4 available at the device."
        ]
      },
      {
        "id":"ipv6CompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on layer 3 for IPv6 available at the device."
        ]
      },
      {
        "id":"l3vpnCompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on level of layer 3 VPN available at the device."
        ]
      },
      {
        "id":"layer4CompressionIsAvail",
        "count":1,
        "p":[
          "Packet compression on layer 4 (TCP and UDP header) available at the device."
        ]
      },
      {
        "id":"ContainerConfiguration",
        "count":1,
        "p":[
          "Basic principles for defining the Default values of Configuration attributes:",
          "- NO Default values for attributes that MUST be configured by the controller\/operator while starting the device.",
          "- Default values for every attribute that might be configured also at a later stage.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Configuration messages provided by the device shall contain the current configuration."
        ]
      },
      {
        "id":"container",
        "count":1,
        "p":[
          "Defines the data type of the container offered to client layers."
        ]
      },
      {
        "id":"timeSlotIDList",
        "count":2,
        "p":[
          "Lists the time slots used for transporting this container.",
          "In case ThisContainer::ContainerConfiguration::container::containerType::bundlingIsAvail==0, structureId must be equal for all aiTimeSlots in the list.",
          "_multiplicity:ThisContainer::ContainerConfiguration::container::containerType::numberOfTimeSlotsRequired"
        ]
      },
      {
        "id":"encryptionIsOn",
        "count":1,
        "p":[
          "Activates encryption of the payload."
        ]
      },
      {
        "id":"packetCompressionIsOn",
        "count":1,
        "p":[
          "In case packet compression is activated, but no type is activated, it is assumed that the device choses an optimum."
        ]
      },
      {
        "id":"time8192Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 8192QAM."
        ]
      },
      {
        "id":"vlanCompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on VLAN layer configured at the device."
        ]
      },
      {
        "id":"snrMin",
        "count":2,
        "unit":"dB",
        "p":[
          "Minimum signal to noise ratio."
        ]
      },
      {
        "id":"snrMax",
        "count":2,
        "unit":"dB",
        "p":[
          "Maximum signal to noise ratio."
        ]
      },
      {
        "id":"snrAvg",
        "count":2,
        "unit":"dB",
        "p":[
          "Average signal to noise ratio."
        ]
      },
      {
        "id":"xpdMin",
        "count":2,
        "unit":"dB",
        "p":[
          "Minimum cross polarization discrimination."
        ]
      },
      {
        "id":"xpdMax",
        "count":2,
        "unit":"dB",
        "p":[
          "Maximum cross polarization discrimination."
        ]
      },
      {
        "id":"xpdAvg",
        "count":2,
        "unit":"dB",
        "p":[
          "Average cross polarization discrimination."
        ]
      },
      {
        "id":"rxTempMin",
        "count":2,
        "unit":"°C",
        "p":[
          "Minimum temperature of RF power amplifier."
        ]
      },
      {
        "id":"rxTempMax",
        "count":2,
        "unit":"°C",
        "p":[
          "Maximum temperature of RF power amplifier."
        ]
      },
      {
        "id":"rxTempAvg",
        "count":2,
        "unit":"°C",
        "p":[
          "Average temperature of RF power amplifier."
        ]
      },
      {
        "id":"defectBlocksSum",
        "count":1,
        "p":[
          "Total number of blocks that were defect after receiving and could not be corrected by the FEC."
        ]
      },
      {
        "id":"timePeriod",
        "count":8,
        "unit":"s",
        "p":[
          "Total length of the measurement period.",
          "Total length of the measurement period in seconds.",
          "Required data volume = 17bit",
          "Total length of the measurement period in seconds.",
          "Required data volume = 17bit"
        ]
      },
      {
        "id":"airInterfacePacList",
        "count":1,
        "p":[
          "List of air interfaces, which are part of the co-channel (XPIC, MIMO, AFR) group."
        ]
      },
      {
        "id":"MW_AirInterfaceHsbEndPoint_Pac",
        "count":1,
        "p":[
          "The EndPoint (EP) object class models the access to the FC function. ",
          "Each EndPoint instance has a role (e.g., working, protection, protected, hub, spoke, leaf, root, etc.) with respect to the FC function. ",
          "The association of the FC to LTPs is made via EndPoints (essentially the ports of the FC) where each EndPoint (EP) of the FC has a role in the context of the FC. ",
          "The traffic forwarding between the associated End PointsEPs of the FC depends upon the type of FC and may be associated with FCSwitch object instances.",
          "In cases where there is protection conveys the protecting role of the access to the FC. ",
          "The EP replaces the Protection Unit of a traditional protection model. ",
          "It represents a protected (resilient\/reliable) point or a protecting (unreliable working or protection) point."
        ]
      },
      {
        "id":"MW_AirInterfaceHsbForwardingConstruct_Pac",
        "count":1,
        "p":[
          "The ForwardingConstruct (FC) object class models enabled potential for forwarding between two or more LTPs and like the LTP supports any transport protocol including all circuit and packet forms.",
          "At the lowest level of recursion, a FC represents a cross-connection within an NE."
        ]
      },
      {
        "id":"MW_AirInterfaceHsbFcSwitch_Pac",
        "count":1,
        "p":[
          "Represents and defines a protection switch structure encapsulated in the FC. ",
          "Essentially performs the functoion of Protection Group. Associates to 2 or more Endpoints each playing the role of a Protection Unit. ",
          "One or more protection EndPoints (standby\/backup) provide protection for one or more working (i.e. regular\/main\/preferred) Endpoints where eith protection or working can feed one or more protected Endpoint.",
          "May be used in revertive or non-revertive (symmetric) mode. When in revertive mode may define waitToRestore time.",
          "May be used in one of several modes including source switch, destination switched, source and destination switched etc (covering cases such as  1+1 ane 1:1).. ",
          "May be lockout (prevented from switching), force switched or manual switched.",
          "Will indicate switch state and change of state."
        ]
      },
      {
        "id":"protType",
        "count":1,
        "p":[
          "Indicates the protection scheme that is used for the ProtectionGroup."
        ]
      },
      {
        "id":"airInterfaceHsbConfigurationIsFaultySeverity",
        "count":1,
        "p":[
          "The level of severity of an airInterfaceHsbConfigurationIsFaulty alarm shall be chosen from an enum."
        ]
      },
      {
        "id":"airInterfaceHsbIsPartlyDownSeverity",
        "count":1,
        "p":[
          "The level of severity for one link out of the HSB configuration being down shall be chosen from an enum."
        ]
      },
      {
        "id":"airInterfaceHsbIsDownSeverity",
        "count":1,
        "p":[
          "The level of severity of the total HSB configuration being down shall be chosen from an enum."
        ]
      },
      {
        "id":"MW_AirInterfaceDiversity_Pac",
        "count":1,
        "p":[
          "LTP(MWS-CTP-xD)"
        ]
      },
      {
        "id":"AirInterfaceDiversityCapability",
        "count":2,
        "p":[
          "Describes the capabilities in implementing different types of air interface diversity.",
          "Basic principles for defining the Default values of Capability attributes:",
          "- NO Default values for attributes that MUST be delivered from the device.",
          "- Default values for every attribute that might be delivered.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"airInterfaceDiversityID",
        "count":1,
        "p":[
          "Identifies the air interface diversity group for connecting with Structure."
        ]
      },
      {
        "id":"availableKindsOfDiversity",
        "count":1,
        "p":[
          "Available types of diversity to be listed."
        ]
      },
      {
        "id":"AirInterfaceDiversityConfiguration",
        "count":1,
        "p":[
          "Basic principles for defining the Default values of Configuration attributes:",
          "- NO Default values for attributes that MUST be configured by the controller\/operator while starting the device.",
          "- Default values for every attribute that might be configured also at a later stage.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Configuration messages provided by the device shall contain the current configuration."
        ]
      },
      {
        "id":"airInterfaceDiversity",
        "count":1,
        "p":[
          "Type of air interface diversity configured at the link."
        ]
      },
      {
        "id":"airInterfaceIDList",
        "count":1,
        "p":[
          "_multiplicity:2-ThisAirInterfaceDiversity::AirInterfaceDiversityConfiguration::airInterfaceDiversity::diversityType::numberOfAirInterfacesMax"
        ]
      },
      {
        "id":"AirInterfaceDiversityStatus",
        "count":1,
        "p":[
          "Basic principles for defining the Defaults values of Status attributes:",
          "- Every attribute shall have a Default value.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Status messages provided by the device shall either contain actual status information or if not possible these default values."
        ]
      },
      {
        "id":"airInterfaceDiversityStatus",
        "count":1,
        "p":[
          "Status of the air interface bundle. "
        ]
      },
      {
        "id":"MW_Structure_Pac",
        "count":1,
        "p":[
          "LTP(MWS-TTP)"
        ]
      },
      {
        "id":"StructureCapability",
        "count":2,
        "p":[
          "Describes the logical structuring of the physical capacity provided by the microwave device.",
          "Basic principles for defining the Default values of Capability attributes:",
          "- NO Default values for attributes that MUST be delivered from the device.",
          "- Default values for every attribute that might be delivered.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"structureID",
        "count":1,
        "p":[
          "Identifies the Structure for bundling and container."
        ]
      },
      {
        "id":"timeSlotCapacity",
        "count":2,
        "unit":"kbit\/s",
        "p":[
          "Transport capacity of each time slot."
        ]
      },
      {
        "id":"e1IsAvail",
        "count":1,
        "p":[
          "The 2Mbit\/s transport capacity provided by the structureGroup is used for providing an E1 container to the client layer. "
        ]
      },
      {
        "id":"t1IsAvail",
        "count":1,
        "p":[
          "The 1,5Mbit\/s transport capacity provided by the structureGroup is used for providing a T1 container to the client layer. "
        ]
      },
      {
        "id":"j1IsAvail",
        "count":1,
        "p":[
          "The 1,5Mbit\/s transport capacity provided by the structureGroup is used for providing a J1 container to the client layer."
        ]
      },
      {
        "id":"stm1IsAvail",
        "count":1,
        "p":[
          "The 155Mbit\/s transport capacity provided by the structureGroup is used for providing an STM-1 container to the client layer. "
        ]
      },
      {
        "id":"cpri1IsAvail",
        "count":1,
        "p":[
          "The 614.4Mbit\/s of transport capacity provided by the structureGroup is used for providing a CPRI1 container. "
        ]
      },
      {
        "id":"cpri2IsAvail",
        "count":1,
        "p":[
          "The 1228.8Mbit\/s of transport capacity provided by the structureGroup is used for providing a CPRI2 container."
        ]
      },
      {
        "id":"cpri3IsAvail",
        "count":1,
        "p":[
          "The 2457.6Mbit\/s of transport capacity provided by the structureGroup is used for providing a CPRI3 container. "
        ]
      },
      {
        "id":"cpri4IsAvail",
        "count":1,
        "p":[
          "The 3072.0Mbit\/s of transport capacity provided by the structureGroup is used for providing a CPRI4 container."
        ]
      },
      {
        "id":"cpri5IsAvail",
        "count":1,
        "p":[
          "The 4915.2Mbit\/s of transport capacity provided by the structureGroup is used for providing a CPRI5 container."
        ]
      },
      {
        "id":"cpri6IsAvail",
        "count":1,
        "p":[
          "The 6144.0Mbit\/s of transport capacity provided by the structureGroup is used for providing a CPRI6 container."
        ]
      },
      {
        "id":"cpri7IsAvail",
        "count":1,
        "p":[
          "The 9830.4Mbit\/s of transport capacity provided by the structureGroup is used for providing a CPRI7 container."
        ]
      },
      {
        "id":"hsbCoordinationIsAvail",
        "count":1,
        "p":[
          "At pure outdoor microwave systems, it is required to be able to configure ports for solely coordinating hot standby protection behaviour with the second ODU of the protection configuration.",
          "In case a port can be used for this purpose, this attribute shall be set to '1'."
        ]
      },
      {
        "id":"portIsForHsbCoordination",
        "count":1,
        "p":[
          "At pure outdoor microwave systems, it is required to be able to configure ports for solely coordinating hot standby protection behaviour with the second ODU of the protection configuration.",
          "In case a port shall be used for this purpose, this attribute shall be set to '1'."
        ]
      },
      {
        "id":"SuperClasses",
        "count":1,
        "p":[
          "SuperClasses provided by the ONF equipment model."
        ]
      },
      {
        "id":"Equipment",
        "count":2,
        "p":[
          "ONF Equipment Model (ONF 2015.499), Draft Version 0.1, September 25th of 2015",
          "Equipment is a Field Replaceable Unit (FRU), the pieces that an Enterprise or Service Provider would normally work with. Typical types of Equipment include Chassis, Module, Power supply module, Fan unit, Server, Blade Server, Disk Drive, Wi-Fi Access Point unit."
        ]
      },
      {
        "id":"EquipmentHolder",
        "count":2,
        "p":[
          "ONF Equipment Model (ONF 2015.499), Draft Version 0.1, September 25th of 2015",
          "EquipmentHolder is the part of Equipment used to house other pieces of Equipment. An EquipmentHolder may be empty or occupied. Typical types of Equipment Holders include Slot, PluggableUnitHolder (GBIC, SFP), Fan slot and Power supply slot."
        ]
      },
      {
        "id":"PhysicalConnector",
        "count":2,
        "p":[
          "ONF Equipment Model (ONF 2015.499), Draft Version 0.1, September 25th of 2015",
          "PhysicalConnector is the part of Equipment used for attaching cable connectors. Typical types of connector are Ethernet RJ45, Optic Fibre, and Power connector."
        ]
      },
      {
        "id":"ObjectCreationNotification",
        "count":1,
        "p":[
          "To be sent when a new MW_AirInterface_Pac, MW_AirInterfaceDiversity_Pac, MW_Structure_Pac or MW_Container_Pac has to be instancieted in the controller."
        ]
      },
      {
        "id":"counter",
        "count":4,
        "p":[
          "Counts object creation notifications.",
          "Counts object deletion notifications.",
          "Counts attribute value changed notifications.",
          "Counts problem notifications"
        ]
      },
      {
        "id":"objectID",
        "count":4,
        "p":[
          "ID of the affected MW_AirInterface_Pac, MW_AirInterfaceDiversity_Pac, MW_Structure_Pac or MW_Container_Pac",
          "ID of the affected MW_AirInterface_Pac, MW_AirInterfaceDiversity_Pac, MW_Structure_Pac or MW_Container_Pac",
          "ID of the affected MW_AirInterface_Pac, MW_AirInterfaceDiversity_Pac, MW_Structure_Pac or MW_Container_Pac",
          "ID of the affected MW_AirInterface_Pac, MW_AirInterfaceDiversity_Pac, MW_Structure_Pac or MW_Container_Pac"
        ]
      },
      {
        "id":"objectType",
        "count":1,
        "p":[
          "Type of Object to be chosen from the following list of values: 'MW_AirInterface_Pac', 'MW_AirInterfaceDiversity_Pac', 'MW_Structure_Pac', 'MW_Container_Pac'"
        ]
      },
      {
        "id":"ObjectDeletionNotification",
        "count":1,
        "p":[
          "To be sent when a MW_AirInterface_Pac, MW_AirInterfaceDiversity_Pac, MW_Structure_Pac or MW_Container_Pac instance has to be deleted in the controller."
        ]
      },
      {
        "id":"AttributeValueChangedNotification",
        "count":1,
        "p":[
          "To be sent when an attribute has changed and one or more controllers have to update their data."
        ]
      },
      {
        "id":"attributeName",
        "count":1,
        "p":[
          "Name of the attribute that has been changed."
        ]
      },
      {
        "id":"newValue",
        "count":1,
        "p":[
          "Attribute value converted to a sring (xml, json, ...)"
        ]
      },
      {
        "id":"ProblemNotification",
        "count":1,
        "p":[
          "To be sent when a problem occurs at a MW_AirInterface_Pac, MW_AirInterfaceDiversity_Pac, MW_Structure_Pac or a MW_Container_Pac."
        ]
      },
      {
        "id":"problem",
        "count":1,
        "p":[
          "Name of the problem according to AirInterface::AirInterfaceCapability::supportedAlarms or AirInterfaceDiversity::AirInterfaceDiversityCapability::supportedAlarms or Structure::StructureCapability::supportedAlarms or Container::ContainerCapability::supportedAlarms"
        ]
      },
      {
        "id":"severity",
        "count":1,
        "p":[
          "Severity of the problem according to AirInterface::AirInterfaceConfiguration::problemSeverityList, AirInterfaceDiversity::AirInterfaceDiversityConfiguration::problemSeverityList, Structure::StructureConfiguration::problemSeverityList and Container::ContainerConfiguration::problemSeverityList"
        ]
      },
      {
        "id":"AirInterfaceIsPartOfHsbGroup",
        "count":1,
        "p":[
          "just explanatory",
          "Association is actually between ",
          "LogicalTerminationPoint and EndPoint "
        ]
      },
      {
        "id":"StructureLtpIsProtected",
        "count":1,
        "p":[
          "just explanatory",
          "Association is actually between ",
          "LogicalTerminationPoint and EndPoint "
        ]
      },
      {
        "id":"layer2CompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on layer 2 configured at the device."
        ]
      },
      {
        "id":"qInQCompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on layer of a second VLAN configured at the device."
        ]
      },
      {
        "id":"mplsCompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on MPLS layer configured at the device."
        ]
      },
      {
        "id":"l2vpnCompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on level of layer 2 VPN configured at the device."
        ]
      },
      {
        "id":"ipv4CompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on layer 3 for IPv4 configured at the device."
        ]
      },
      {
        "id":"ipv6CompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on layer 3 for IPv6 configured at the device."
        ]
      },
      {
        "id":"l3vpnCompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on level of layer 3 VPN configured at the device."
        ]
      },
      {
        "id":"layer4CompressionIsOn",
        "count":1,
        "p":[
          "Packet compression on layer 4 (TCP and UDP header) configured at the device."
        ]
      },
      {
        "id":"ContainerStatus",
        "count":1,
        "p":[
          "Basic principles for defining the Defaults values of Status attributes:",
          "- Every attribute shall have a Default value.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Status messages provided by the device shall either contain actual status information or if not possible these default values."
        ]
      },
      {
        "id":"getContainerCapacity",
        "count":1,
        "p":[
          "Provides the current capacity of the Container (only reasonable for Ethernet containers) in Mbit\/s.",
          "The number of time slots, which have operational state = \"up\" but are not reserved for TDM, has to be multiplied with the capacity of a single time slot calculated by Structure::StructureCapability::getTimeSlotCapacity()."
        ]
      },
      {
        "id":"ContainerHistoricalPerformance",
        "count":1,
        "p":[
          "Basic principles for defining the Defaults values of Performance attributes:",
          "- Every attribute shall have a Default value.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"txEthernetBytesMaxS",
        "count":3,
        "unit":"Bytes\/s",
        "p":[
          "Counts the number of Bytes of Ethernet traffic (before header compression) transmitted within a second and keeps the highest value within the measurement period.",
          "Field to be left blank for all types of TDM containers.",
          "Required data volume = 31bit"
        ]
      },
      {
        "id":"txEthernetBytesMaxM",
        "count":3,
        "unit":"Bytes\/min",
        "p":[
          "Counts the number of Bytes of Ethernet traffic (before header compression) transmitted within a minute and keeps the highest value with in the measurement period.",
          "Field to be left blank for all types of TDM containers.",
          "Required data volume = 37bit"
        ]
      },
      {
        "id":"txEthernetBytesSum",
        "count":3,
        "unit":"Bytes",
        "p":[
          "Total number of Bytes of Ethernet traffic (before header compression) transmitted (in direction out of the device) during the measurement period.",
          "Field to be left blank for all types of TDM containers.",
          "Required data volume = 47bit"
        ]
      },
      {
        "id":"MwCurrentProblem",
        "count":1,
        "p":[
          "According to ITU-T G.874.1?"
        ]
      },
      {
        "id":"HistoryData",
        "count":1,
        "p":[
          "ITU-T G.822"
        ]
      },
      {
        "id":"hsbNumberMax",
        "count":1,
        "p":[
          "Maximum number of hot stand-by groups configurable."
        ]
      },
      {
        "id":"sdNumberMax",
        "count":1,
        "p":[
          "Maximum number of space diversity groups configurable."
        ]
      },
      {
        "id":"fdNumberMax",
        "count":1,
        "p":[
          "Maximum number of frequency diversity groups configurable."
        ]
      },
      {
        "id":"l1BNumberMax",
        "count":1,
        "p":[
          "Maximum number of layer 1 bundling groups."
        ]
      },
      {
        "id":"cpriBNumberMax",
        "count":1,
        "p":[
          "Maximum number of CPRI bundling groups."
        ]
      },
      {
        "id":"e1SncpNumberMax",
        "count":1,
        "p":[
          "Maximum number of E1 protections."
        ]
      },
      {
        "id":"t1j1SncpNumberMax",
        "count":1,
        "p":[
          "Maximum number of T1 or J1 protections."
        ]
      },
      {
        "id":"stm1MspNumberMax",
        "count":1,
        "p":[
          "Maximum number of STM-1 protections."
        ]
      },
      {
        "id":"mwChassisId",
        "count":1,
        "p":[
          "Operator specific network element ID (often used for coding area, type of element and sequential number)."
        ]
      },
      {
        "id":"timeAndDate",
        "count":1,
        "p":[
          "This attribute set the time for the microwave device."
        ]
      },
      {
        "id":"ntpServerIpAddress",
        "count":1,
        "p":[
          "This parameter sets the IP address of the remote NTP server."
        ]
      },
      {
        "id":"ftpServerAddressAndLogin",
        "count":1,
        "p":[
          "ftp server name <NAME> address <ADDRESS> [port <PORT>] [user <USER> [password <PASS>] ] [servertype <PROTOCOL>]"
        ]
      },
      {
        "id":"chassisTempCur",
        "count":1,
        "p":[
          "Current temperature inside the indoor unit (chassis) in Celsius. (In case of pure outdoor implementation of the microwave, the temperature inside the outdoor unit is to be filled-in.)"
        ]
      },
      {
        "id":"MW_AirInterfacePort",
        "count":1,
        "p":[
          "Intermediate Frequency Port."
        ]
      },
      {
        "id":"ifPortID",
        "count":1,
        "p":[
          "Vendor defined identifier of the IF port."
        ]
      },
      {
        "id":"MW_AirInterface_Pac",
        "count":1,
        "p":[
          "LTP(MWPS-TTP)"
        ]
      },
      {
        "id":"ethernetIsAvail",
        "count":1,
        "p":[
          "The pure packet transport capacity of the structureGroup is used for providing a container for Ethernet traffic."
        ]
      },
      {
        "id":"AirInterfaceCapability",
        "count":2,
        "p":[
          "Describes the \"analog\" capabilities of modem and transmitter of the microwave device.",
          "Value ranges of attributes are not independently (e.g. min. and max. transmit power depends on modulation).",
          "Legal combinations of values are expressed in scripts.",
          "Basic principles for defining the Default values of Capability attributes:",
          "- NO Default values for attributes that MUST be delivered from the device.",
          "- Default values for every attribute that might be delivered.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"airInterfaceID",
        "count":1,
        "p":[
          "Identifies the air interface for connecting with structure or diversity."
        ]
      },
      {
        "id":"typeOfEquipment",
        "count":1,
        "p":[
          "This parameter indicates the equipment type.",
          "Instead of uploading the complete set of capabilities, capabilities of the same equipment type could be reused."
        ]
      },
      {
        "id":"txFrequencyMin",
        "count":2,
        "unit":"kHz",
        "p":[
          "Value of the minimum transmit frequency tunable at the air interface.",
          "This value is only relevant, if the channel plan, which is referenced in channelPlanID is stored in the controller."
        ]
      },
      {
        "id":"txFrequencyMax",
        "count":2,
        "unit":"kHz",
        "p":[
          "Value of the maximum transmit frequency tunable at the air interface.",
          "This value is only relevant, if the channel plan, which is referenced in channelPlanID is stored in the controller."
        ]
      },
      {
        "id":"rxFrequencyMin",
        "count":2,
        "unit":"kHz",
        "p":[
          "Value of the minimum receive frequency tunable at the air interface.",
          "This value is only relevant, if the channel plan, which is referenced in channelPlanID is stored in the controller."
        ]
      },
      {
        "id":"rxFrequencyMax",
        "count":2,
        "unit":"kHz",
        "p":[
          "Value of the maximum receive frequency tunable at the air interface.",
          "This value is only relevant, if the channel plan, which is referenced in channelPlanID is stored in the controller."
        ]
      },
      {
        "id":"adaptiveModulationIsAvail",
        "count":1,
        "p":[
          "In case the Air Interface Port is capable of adaptive modulation, this field shall contain an '1'."
        ]
      },
      {
        "id":"mimoIsAvail",
        "count":1,
        "p":[
          "In case the device is capable of MIMO, this field shall contain an '1'."
        ]
      },
      {
        "id":"mimoChannels",
        "count":1,
        "p":[
          "Maximum number (n) of Air Interfaces that can be combined to a n x n MIMO configuration."
        ]
      },
      {
        "id":"afrIsAvail",
        "count":1,
        "p":[
          "In case the microwave radio is capable of Advanced Frequency Reuse (canceling of interference cause by transmitters located at the same site), this field shall contain an '1'."
        ]
      },
      {
        "id":"atpcIsAvail",
        "count":1,
        "p":[
          "In case the microwave radio is capable of ATPC, this field shall contain an '1'."
        ]
      },
      {
        "id":"atpcRange",
        "count":2,
        "unit":"dB",
        "p":[
          "Extent of the ATPC range. ",
          "The value should be set to '0' in case ATPC feature bit is '0'."
        ]
      },
      {
        "id":"loopBackIsAvail",
        "count":1,
        "p":[
          "In case the radio is capable of looping back header information of the air interface, this field shall contain an '1'."
        ]
      },
      {
        "id":"maintenanceTimerRange",
        "count":2,
        "unit":"seconds",
        "p":[
          "The device shall describe the range of the configurable time of existence of any maintenance configuration (e.g. the loop back of microwave header information).",
          "A list of values shall be separated by commas.",
          "A value range shall be expressed by two values separated by a minus."
        ]
      },
      {
        "id":"supportedAlarms",
        "count":4,
        "p":[
          "Available alarms to be listed.",
          "Mandatory:'aiConfigurationIsFaulty','signalIsLost','rslIsExceeded','temperatureIsExceeded','modemIsFaulty','radioIsFaulty' and 'modulationIsDownShifted'.",
          "Names are to be separated by commas.",
          "Further alarms might be added by the device.",
          "Available alarms to be listed.",
          "Mandatory:'airInterfaceDiversityConfigurationIsFaulty','airInterfaceDiversityConfigurationIsPartlyDown' and 'airInterfaceDiversityConfigurationIsDown'.",
          "Names are to be separated by commas.",
          "Further alarms might be added by the device.",
          "Available alarms to be listed.",
          "Mandatory:'structureConfigurationIsFaulty'.",
          "Names are to be separated by commas.",
          "Further alarms might be added by the device.",
          "Available alarms to be listed.",
          "Mandatory:'containerConfigurationIsFaulty','framingIsFaulty' and 'containerIsDown'.",
          "Names are to be separated by commas.",
          "Further alarms might be added by the device."
        ]
      },
      {
        "id":"supportedChannelPlanList",
        "count":1,
        "p":[
          "List of channel spacing that are supported by the device."
        ]
      },
      {
        "id":"AirInterfaceConfiguration",
        "count":2,
        "p":[
          "Configuration of the device.",
          "Basic principles for defining the Default values of Configuration attributes:",
          "- NO Default values for attributes that MUST be configured by the controller\/operator while starting the device.",
          "- Default values for every attribute that might be configured also at a later stage.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Configuration messages provided by the device shall contain the current configuration."
        ]
      },
      {
        "id":"airInterfaceName",
        "count":1,
        "p":[
          "Operator specific microwave link ID (often used for coding area, type of element and sequential number)."
        ]
      },
      {
        "id":"radioSignalId",
        "count":2,
        "p":[
          "The radioSignalId is transmitted on the air interface so the remote site of the link synchronizes on the correct transmitter.",
          "The local radio MUST NOT synchronize on a radio signal with a different radioSignalId.",
          "The link ID is neither an ID necessary to span the model nor an ID referencing external data. It is just some sort of name of the link transmitted so the correct remote site can be identified in an interference situation.",
          "The value zero might be used to make the microwave to disable the link ID check."
        ]
      },
      {
        "id":"txFrequency",
        "count":2,
        "unit":"kHz",
        "p":[
          "Center frequency of the transmit channel.",
          "The values to be configured have to exactly match the values listed in the international agreement referenced in channelPlanID.",
          "In case of automated selection of the transmit frequency this field shall describe the lowest center frequency selectable."
        ]
      },
      {
        "id":"rxFrequency",
        "count":2,
        "unit":"kHz",
        "p":[
          "Center frequency of the receive channel."
        ]
      },
      {
        "id":"txChannelBandwidth",
        "count":2,
        "unit":"kHz",
        "p":[
          "Bandwidth of the transmit channel. ",
          "The value shall be expressed explicitly (means in kHz) not as a reference to an international agreement. ",
          "The values shall be chosen from the following _list: 3.500, 7.000, 14.000, 27.500, 28.000, 29.000, 29.650, 30.000, 40.000, 50.000, 55.000, 56.000, 59.300, 60.000, 80.000, 100.000, 112.000, 120.000, 150.000, 200.000, 250.000, 500.000, 750.000, 1.000.000, 1.250.000, 1.500.000, 1.750.000, 2.000.000;"
        ]
      },
      {
        "id":"rxChannelBandwidth",
        "count":2,
        "unit":"kHz",
        "p":[
          "Bandwidth of the receive channel. ",
          "The value shall be expressed explicitly (means in kHz) not as a reference to an international agreement. ",
          "The values shall be chosen from the following _list: 3.500, 7.000, 14.000, 27.500, 28.000, 29.000, 29.650, 30.000, 40.000, 50.000, 55.000, 56.000, 59.300, 60.000, 80.000, 100.000, 112.000, 120.000, 150.000, 200.000, 250.000, 500.000, 750.000, 1.000.000, 1.250.000, 1.500.000, 1.750.000, 2.000.000;"
        ]
      },
      {
        "id":"polarization",
        "count":1,
        "p":[
          "Allows to document the polarization of the air interface."
        ]
      },
      {
        "id":"powerIsOn",
        "count":1,
        "p":[
          "Power ON. Activation of the entire radio in a split mount configuration shall be expressed as an '1'."
        ]
      },
      {
        "id":"transmitterIsOn",
        "count":1,
        "p":[
          "Transmit Power. Activation of the transmitter inside the radio shall be expressed as an '1'."
        ]
      },
      {
        "id":"txPower",
        "count":2,
        "unit":"dBm",
        "p":[
          "Transmit power to be configured on the microwave link. Signed Byte is required.",
          "The actually operated transmit power might be lower depending on adaptive modulation and ATPC."
        ]
      },
      {
        "id":"adaptiveModulationIsOn",
        "count":1,
        "p":[
          "Adaptive Modulation. Activation of adaptive modulation shall be expressed as an '1'."
        ]
      },
      {
        "id":"severityType",
        "count":1,
        "p":[
          "According to ITU-T M.3160"
        ]
      },
      {
        "id":"supportedChannelPlans",
        "count":1,
        "p":[
          "Unique identifier of an international agreement that describe allocations of frequency channels, to which this air interface complies, to be listed.",
          "Corresponding channel plans to be delivered by the hardware vendor and to be stored by the operator in the controller\/application\/attached database."
        ]
      },
      {
        "id":"duplexDistanceIsVariable",
        "count":1,
        "p":[
          "'1' in case the distance between transmitted and received frequency is variable."
        ]
      },
      {
        "id":"duplexDistance",
        "count":2,
        "unit":"kHz",
        "p":[
          "Distance between transmitted and received frequency."
        ]
      },
      {
        "id":"autoFreqSelectIsAvail",
        "count":1,
        "p":[
          "In case the microwave radio is capable of automatically selecting the transmit frequency in unlicensed bands, this field shall contain an '1'."
        ]
      },
      {
        "id":"transmissionModeType",
        "count":1,
        "p":[
          "Basic principles for defining the Default values of Capability\/transmissionMode attributes:",
          "- NO Default values for attributes that MUST be delivered from the device.",
          "- Default values for every attribute that might be delivered.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"transmissionModeID",
        "count":1,
        "p":[
          "Indentifies the transmissionMode for internal reference."
        ]
      },
      {
        "id":"channelBandwidth",
        "count":2,
        "unit":"kHz",
        "p":[
          "Bandwidth of the transmit channel. ",
          "The value shall be expressed explicitly (means in kHz) not as a reference to an international agreement. ",
          "The values shall be chosen from the following _list: 3.500, 7.000, 14.000, 27.500, 28.000, 29.000, 29.650, 30.000, 40.000, 50.000, 55.000, 56.000, 59.300, 60.000, 80.000, 100.000, 112.000, 120.000, 150.000, 200.000, 250.000, 500.000, 750.000, 1.000.000, 1.250.000, 1.500.000, 1.750.000, 2.000.000;"
        ]
      },
      {
        "id":"modulationScheme",
        "count":2,
        "unit":"symbols",
        "p":[
          "Modulation scheme, which is base to the other characteristics described in the same instance of Script.",
          "The modulation scheme shall be described by the number of symbols (e.g. BPSK->'2' or 256QAM->'256')."
        ]
      },
      {
        "id":"informationRate",
        "count":2,
        "unit":"%",
        "p":[
          "Information rate of the coding scheme in %."
        ]
      },
      {
        "id":"txPowerMin",
        "count":2,
        "unit":"dBm",
        "p":[
          "Value of the minimum transmit power the modem can operate in dBm."
        ]
      },
      {
        "id":"txPowerMax",
        "count":2,
        "unit":"dBm",
        "p":[
          "Value of the maximum transmit power the modem can operate in dBm."
        ]
      },
      {
        "id":"rxThreshold",
        "count":2,
        "unit":"dBm",
        "p":[
          "Value of the receive level required to decode the received signal with a Bit Error Rate of 1e-6 or less."
        ]
      },
      {
        "id":"amUpshiftLevel",
        "count":2,
        "unit":"dBm",
        "p":[
          "Value of the receive level that has to be exceeded to shift into a higher modulation scheme."
        ]
      },
      {
        "id":"amDownshiftLevel",
        "count":2,
        "unit":"dBm",
        "p":[
          "Value of the receive level that has to be exceeded for not shifting into a lower modulation scheme."
        ]
      },
      {
        "id":"xpicIsAvail",
        "count":1,
        "p":[
          "In case the Air Interface Port is capable of XPIC, this field shall contain an '1'."
        ]
      },
      {
        "id":"problemName",
        "count":4,
        "p":[
          "Name of the alarm according to AirInterface::AirInterfaceCapability::supportedAlarms",
          "Name of the alarm according to AirInterfaceDiversity::AirInterfaceDiversityCapability::supportedAlarms",
          "Name of the alarm according to Structure::StructureCapability::supportedAlarms",
          "Name of the alarm according to Container::ContainerCapability::supportedAlarms"
        ]
      },
      {
        "id":"problemSeverity",
        "count":4,
        "p":[
          "Severity of the alarm.",
          "Severity of the alarm.",
          "Severity of the alarm.",
          "Severity of the alarm."
        ]
      },
      {
        "id":"diversityName",
        "count":1,
        "p":[
          "Names to be chosen from the following list: 'spaceDiversity', 'frequencyDiversity'"
        ]
      },
      {
        "id":"numberOfAirInterfacesMax",
        "count":1,
        "p":[
          "Maximum number of air interfaces that could be part of this kind of diversity."
        ]
      },
      {
        "id":"allAiActive",
        "count":1,
        "p":[
          "All air interfaces that are part of the diversity configuration are working."
        ]
      },
      {
        "id":"notAllAiActive",
        "count":1,
        "p":[
          "At least one, but not all of the air interfaces that are part of the diversity configuration is not working."
        ]
      },
      {
        "id":"groupDown",
        "count":1,
        "p":[
          "All air interfaces that are members of the diversity configuration are down."
        ]
      },
      {
        "id":"containerName",
        "count":1,
        "p":[
          "Names to be chosen from the following list: 'ethernet','e1','t1','j1','e3','ds3','stm1','cpri1','cpri2','cpri3','cpri4','cpri5','cpri6' or 'cpri7'"
        ]
      },
      {
        "id":"numberOfTimeSlotsRequired",
        "count":1,
        "p":[
          "Number of time slots required for transporting this type of container. Value must be calculated by the vendor after defining the timeSlotCapacity. For containers of fixed size: numberOfTimeSlotsRequired = required bandwidth of the container divided by timeSlotCapacity. For containers of variable size the minimum (most probably 1) is to be stated."
        ]
      },
      {
        "id":"tdmTimeSlotsIsRequired",
        "count":1,
        "p":[
          "Shall be set to '1', if this container type requires bandwidth (times slots) reserved for TDM transport."
        ]
      },
      {
        "id":"bundlingIsAvail",
        "count":1,
        "p":[
          "If it is possible to combine transport resources of several radio links to transport this container type, this attribute shall be set to '1'."
        ]
      },
      {
        "id":"timeSlotIDType",
        "count":2,
        "p":[
          "Identifies the time slots, which are used to transport the container.",
          "Combinations of structureID and timeSlotID must be unique inside the device to assure that every resource is used just once."
        ]
      },
      {
        "id":"timeSlotIsReservedForTdm",
        "count":1,
        "p":[
          "The number of time slots, which is configured by Structure::StructureConfiguration::tdmReservedNumberOfTimeSlots, has to be reserved for TDM.",
          "Starting from the lowest index value, these time slots have to be marked with an '1' in timeSlotIsReservedForTdm."
        ]
      },
      {
        "id":"priorityClass",
        "count":2,
        "p":[
          "PriorityClass as inherited from the associated Container::ContainerConfiguration::priorityClass.",
          "In case the device is capable of adapting the sequence, in which time slots are being dropped in case of decreasing capacity of the air interface, priorityClass shall be considered, while calculating the dropOrderRank.",
          "0 = lowest and 7 = highest Priority.",
          "Any value apart the Default is only effective if the device is capable of adapting the sequence, in which time slots are being dropped in case of decreasing capacity of the air interface."
        ]
      },
      {
        "id":"dropOrderRank",
        "count":3,
        "p":[
          "In case the device is NOT capable of adapting the sequence, in which time slots are being dropped in case of decreasing capacity of the air interface, dropOrderRank is number of time slots minus sequence number of the time slot.",
          "In case the device is capable of adapting the sequence, dropOrderRank has to be calculated by the device in dependency to the assigned priorityClass.",
          "_unique: within Structure::StructureStatus::timeSlotStatusList",
          "dropOrderRank as inherited from the associated Structure::StructureStatus::timeSlotStatusType::dropOrderRank. ",
          "If several time slots are associated, the lowest value shall be taken."
        ]
      },
      {
        "id":"operationalStatus",
        "count":1,
        "p":[
          "Current operational status of each time slot."
        ]
      },
      {
        "id":"autoFreqSelectIsUp",
        "count":1,
        "p":[
          "If automated frequency selection is currently actually working (not just configured), this shall be expressed as an '1'."
        ]
      },
      {
        "id":"layerProtocol",
        "count":4,
        "p":[
          "CoreModel-CoreNetworkModule-ObjectClasses:NetworkElement\/_ltpRefList\/_lpList\/uuid",
          "CoreModel-CoreNetworkModule-ObjectClasses:NetworkElement\/_ltpRefList\/_lpList\/uuid",
          "CoreModel-CoreNetworkModule-ObjectClasses:NetworkElement\/_ltpRefList\/_lpList\/uuid",
          "CoreModel-CoreNetworkModule-ObjectClasses:NetworkElement\/_ltpRefList\/_lpList\/uuid"
        ]
      },
      {
        "id":"getAirInterfaceCapacity",
        "count":1,
        "p":[
          "Provides the current Capacity of the Air Interface in Mbit\/s based on channel bandwidth, modulation, coding and so on."
        ]
      },
      {
        "id":"AirInterfaceHistoricalPerformance",
        "count":2,
        "p":[
          "Consolidated performance informantion of the air interface.",
          "Basic principles for defining the Defaults values of Performance attributes:",
          "- Every attribute shall have a Default value.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute."
        ]
      },
      {
        "id":"es",
        "count":2,
        "unit":"s",
        "p":[
          "Number of errored seconds."
        ]
      },
      {
        "id":"ses",
        "count":2,
        "unit":"s",
        "p":[
          "Number of severely errored seconds."
        ]
      },
      {
        "id":"cses",
        "count":2,
        "unit":"s",
        "p":[
          "Number of consecutive severely errored seconds."
        ]
      },
      {
        "id":"unavailability",
        "count":2,
        "unit":"s",
        "p":[
          "Total time of unavailability in seconds."
        ]
      },
      {
        "id":"txLevelMin",
        "count":2,
        "unit":"dBm",
        "p":[
          "Minimum transmit power. Signed integers are required."
        ]
      },
      {
        "id":"txLevelMax",
        "count":2,
        "unit":"dBm",
        "p":[
          "Maximum transmit power. Signed integers are required."
        ]
      },
      {
        "id":"txLevelAvg",
        "count":2,
        "unit":"dBm",
        "p":[
          "Average transmit power. Signed integers are required."
        ]
      },
      {
        "id":"rxLevelMin",
        "count":2,
        "unit":"dBm",
        "p":[
          "Minimum receive level. Signed integers are required."
        ]
      },
      {
        "id":"rxLevelMax",
        "count":2,
        "unit":"dBm",
        "p":[
          "Maximum receive level. Signed integers are required."
        ]
      },
      {
        "id":"rxLevelAvg",
        "count":2,
        "unit":"dBm",
        "p":[
          "Average receive level. Signed integers are required."
        ]
      },
      {
        "id":"time2Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. BPSC."
        ]
      },
      {
        "id":"time4SymbolsS",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 4QAM strong."
        ]
      },
      {
        "id":"time4Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 4QAM."
        ]
      },
      {
        "id":"time8Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 8QAM."
        ]
      },
      {
        "id":"time16SymbolsS",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 16QAM strong."
        ]
      },
      {
        "id":"time16Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 16QAM."
        ]
      },
      {
        "id":"time32Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 32QAM."
        ]
      },
      {
        "id":"time64Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 64QAM."
        ]
      },
      {
        "id":"time128Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 128QAM."
        ]
      },
      {
        "id":"time256Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 256QAM."
        ]
      },
      {
        "id":"time512Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 512QAM."
        ]
      },
      {
        "id":"time512SymbolsL",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 512QAM light."
        ]
      },
      {
        "id":"time1024Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 1024QAM."
        ]
      },
      {
        "id":"time1024SymbolsL",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 1024QAM light."
        ]
      },
      {
        "id":"time2048Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 2048QAM."
        ]
      },
      {
        "id":"time2048SymbolsL",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 2048QAM light."
        ]
      },
      {
        "id":"time4096Symbols",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 4096QAM."
        ]
      },
      {
        "id":"time4096SymbolsL",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g.  4096QAM light."
        ]
      },
      {
        "id":"modulationMin",
        "count":2,
        "unit":"symbols",
        "p":[
          "Minimum modulation to be configured (in case adaptive modulation is not used, this value represents also the fixed modulation).",
          "The modulation scheme shall be described by the number of symbols (e.g. BPSK->'2' or 256QAM->'256').",
          "Allowed values are defined in AirInterface::Script::modulationScheme (all instances of the device)."
        ]
      },
      {
        "id":"time8192SymbolsL",
        "count":2,
        "unit":"s",
        "p":[
          "Sum of all seconds the transmitter operated in e.g. 8192QAM light."
        ]
      },
      {
        "id":"modulationMax",
        "count":2,
        "unit":"symbols",
        "p":[
          "Maximum modulation to be configured. The value of this field is only relevant, if Adaptive Modulation has been activated.",
          "The modulation scheme shall be described by the number of symbols (e.g. BPSK->'2' or 256QAM->'256').",
          "Allowed values are defined in AirInterface::Script::modulationScheme (all instances of the device)."
        ]
      },
      {
        "id":"xpicIsOn",
        "count":1,
        "p":[
          "XPIC. Activation of Cross Polarization Interference Cancellation shall be expressed as an '1'."
        ]
      },
      {
        "id":"mimoIsOn",
        "count":1,
        "p":[
          "Activation of Multiple Input Multiple Output shall be expressed as an '1'."
        ]
      },
      {
        "id":"afrIsOn",
        "count":1,
        "p":[
          "Activation of Advanced Frequency Reuse shall be expressed as an '1'."
        ]
      },
      {
        "id":"coChannelGroup",
        "count":2,
        "p":[
          "Points to group of co-channel (XPIC, MIMO, AFR) air interfaces.",
          "Type of group of air interfaces with the same transmit and receive frequency.",
          "The values shall be chosen from the following _list:'XPIC', 'MIMO', 'AFR';"
        ]
      },
      {
        "id":"atpcIsOn",
        "count":1,
        "p":[
          "ATPC. Activation of Automated Transmit Power Control shall be expressed as an '1'."
        ]
      },
      {
        "id":"atpcThreshUpper",
        "count":2,
        "unit":"dBm",
        "p":[
          "If the receive level is higher than the upper threshold value, the transmitter is notified to decrease transmit power."
        ]
      },
      {
        "id":"atpcThreshLower",
        "count":2,
        "unit":"dBm",
        "p":[
          "If the receive level is lower than the lower threshold value, the transmitter is notified to increase transmit power."
        ]
      },
      {
        "id":"autoFreqSelectIsOn",
        "count":1,
        "p":[
          "Activation of automatically selecting the transmit frequency in unlicensed bands shall be expressed as an '1'."
        ]
      },
      {
        "id":"autoFreqSelectRange",
        "count":1,
        "p":[
          "Number of transmit channels (starting at the center frequency defined in txFrequency and with channel bandwidth according to txChannelBandwidth) that define the range within the transmit frequency can automatically been chosen. "
        ]
      },
      {
        "id":"modulationIsOn",
        "count":2,
        "p":[
          "Maintenance Feature",
          "De-activation of the modulation of the carrier signal for fault management shall be expressed as an '0'."
        ]
      },
      {
        "id":"loopBackIsOn",
        "count":2,
        "p":[
          "Maintenance Feature",
          "If this attribute is set to '1', the received IF signal is transmitted back to the remote end."
        ]
      },
      {
        "id":"maintenanceTimer",
        "count":2,
        "unit":"s",
        "p":[
          "Time of existence of any maintenance configuration (e.g. the loop back of microwave header information).",
          "Allowed values are defined in AirInterface::AirInterfaceCapability::maintenanceTimerRange."
        ]
      },
      {
        "id":"problemSeverityList",
        "count":4,
        "p":[
          "Severity of the problem to be configured.",
          "Severity of the problem to be configured.",
          "Severity of the type of problem to be configured.",
          "Severity of the problem to be configured."
        ]
      },
      {
        "id":"AirInterfaceStatus",
        "count":2,
        "p":[
          "Measurements of current values on the air interface and operational status of the device.",
          "Basic principles for defining the Defaults values of Status attributes:",
          "- Every attribute shall have a Default value.",
          "- The Default value shall be inside the value range of the data type of the attribute.",
          "- The Default value shall be outside the range of reasonable values of the attribute.",
          "- Unless there is a value, which the attribute always has right after starting the device.",
          "Status messages provided by the device shall either contain actual status information or if not possible these default values."
        ]
      },
      {
        "id":"txFrequencyCur",
        "count":2,
        "unit":"kHz",
        "p":[
          "Center frequency of the currently operated transmit channel."
        ]
      },
      {
        "id":"rxFrequencyCur",
        "count":2,
        "unit":"kHz",
        "p":[
          "Center frequency of the currently operated receive channel."
        ]
      },
      {
        "id":"txLevelCur",
        "count":2,
        "unit":"dBm",
        "p":[
          "Current transmit level. Signed Byte is required."
        ]
      },
      {
        "id":"rxLevelCur",
        "count":2,
        "unit":"dBm",
        "p":[
          "Current receive level. Signed Byte is required."
        ]
      },
      {
        "id":"modulationCur",
        "count":2,
        "unit":"symbols",
        "p":[
          "Currently operated modulation on transmit path.",
          "The modulation scheme shall be described by the number of symbols (e.g. BPSK->'2' or 256QAM->'256').",
          "Allowed values are defined in AirInterface::Script::modulationScheme (all instances of the device)."
        ]
      },
      {
        "id":"informationRateCur",
        "count":2,
        "unit":"%",
        "p":[
          "Information rate of the currently operated coding scheme."
        ]
      },
      {
        "id":"snrCur",
        "count":2,
        "unit":"dB",
        "p":[
          "Currently measured signal to noise ratio."
        ]
      },
      {
        "id":"xpdCur",
        "count":2,
        "unit":"dB",
        "p":[
          "Currently measured cross polarization discrimination."
        ]
      },
      {
        "id":"rxTempCur",
        "count":2,
        "unit":"°C",
        "p":[
          "Current temperature of the radio frequency power amplifier in the receiver. (If the temperature of the power amplifier in the receiver is not measured, the temperature inside the radio is also fine.)"
        ]
      },
      {
        "id":"lastStatusChange",
        "count":8,
        "p":[
          "Time and date of the last update of the status information.",
          "Time the Air Interface entered its current operational status. ",
          "_format:yyyyMMddhhmmss.s[Z|{+|-}HHMm]",
          "yyyy\t\"0000\"..\"9999\"\tyear",
          "MM\t\t\"01\"..\"12\"\t\t\tmonth",
          "dd\t\t\"01\"..\"31\"\t\t\tday",
          "hh\t\t\"00\"..\"23\"\t\t\thour",
          "mm\t\t\"00\"..\"59\"\t\t\tminute",
          "ss\t\t\"00\"..\"59\"\t\t\tsecond",
          "s\t\t\".0\"..\".9\"\t\t\ttenth of second (set to \".0\" if EMS or NE cannot support this granularity)",
          "Z\t\t\"Z\"\t\t\t\t\tindicates UTC (rather than local time)",
          "{+|-}\t\"+\" or \"-\"\t\t\tdelta from UTC",
          "HH\t\t\"00\"..\"23\"\t\t\ttime zone difference in hours",
          "Time the Diversity Group entered its current operational status. ",
          "_format:yyyyMMddhhmmss.s[Z|{+|-}HHMm]",
          "yyyy\t\"0000\"..\"9999\"\tyear",
          "MM\t\t\"01\"..\"12\"\t\t\tmonth",
          "dd\t\t\"01\"..\"31\"\t\t\tday",
          "hh\t\t\"00\"..\"23\"\t\t\thour",
          "mm\t\t\"00\"..\"59\"\t\t\tminute",
          "ss\t\t\"00\"..\"59\"\t\t\tsecond",
          "s\t\t\".0\"..\".9\"\t\t\ttenth of second (set to \".0\" if EMS or NE cannot support this granularity)",
          "Z\t\t\"Z\"\t\t\t\t\tindicates UTC (rather than local time)",
          "{+|-}\t\"+\" or \"-\"\t\t\tdelta from UTC",
          "HH\t\t\"00\"..\"23\"\t\t\ttime zone difference in hours",
          "Mm\t\t\"00\"..\"59\"\t\t\ttime zone difference in minutes.",
          "_format:yyyyMMddhhmmss.s[Z|{+|-}HHMm]",
          "yyyy\t\"0000\"..\"9999\"\tyear",
          "MM\t\t\"01\"..\"12\"\t\t\tmonth",
          "dd\t\t\"01\"..\"31\"\t\t\tday",
          "hh\t\t\"00\"..\"23\"\t\t\thour",
          "mm\t\t\"00\"..\"59\"\t\t\tminute",
          "ss\t\t\"00\"..\"59\"\t\t\tsecond",
          "s\t\t\".0\"..\".9\"\t\t\ttenth of second (set to \".0\" if EMS or NE cannot support this granularity)",
          "Z\t\t\"Z\"\t\t\t\t\tindicates UTC (rather than local time)",
          "{+|-}\t\"+\" or \"-\"\t\t\tdelta from UTC",
          "HH\t\t\"00\"..\"23\"\t\t\ttime zone difference in hours",
          "Mm\t\t\"00\"..\"59\"\t\t\ttime zone difference in minutes.",
          "Time the Container entered its current operational status. ",
          "Mm\t\t\"00\"..\"59\"\t\t\ttime zone difference in minutes.",
          "_format:yyyyMMddhhmmss.s[Z|{+|-}HHMm]",
          "yyyy\t\"0000\"..\"9999\"\tyear",
          "MM\t\t\"01\"..\"12\"\t\t\tmonth",
          "dd\t\t\"01\"..\"31\"\t\t\tday",
          "hh\t\t\"00\"..\"23\"\t\t\thour",
          "mm\t\t\"00\"..\"59\"\t\t\tminute",
          "ss\t\t\"00\"..\"59\"\t\t\tsecond",
          "s\t\t\".0\"..\".9\"\t\t\ttenth of second (set to \".0\" if EMS or NE cannot support this granularity)",
          "Z\t\t\"Z\"\t\t\t\t\tindicates UTC (rather than local time)",
          "{+|-}\t\"+\" or \"-\"\t\t\tdelta from UTC",
          "HH\t\t\"00\"..\"23\"\t\t\ttime zone difference in hours",
          "Mm\t\t\"00\"..\"59\"\t\t\ttime zone difference in minutes."
        ]
      },
      {
        "id":"radioPowerIsUp",
        "count":1,
        "p":[
          "If the radio unit has power and is switched on, this shall be expressed as an '1'."
        ]
      },
      {
        "id":"linkIsUp",
        "count":1,
        "p":[
          "If connection is established to the remote site with the same linkID, this shall be expressed as an '1'."
        ]
      },
      {
        "id":"xpicIsUp",
        "count":1,
        "p":[
          "If XPIC is currently actually working (not just configured), this shall be expressed as an '1'."
        ]
      },
      {
        "id":"mimoIsUp",
        "count":1,
        "p":[
          "If MIMO is currently actually working (not just configured), this shall be expressed as an '1'."
        ]
      },
      {
        "id":"afrIsUp",
        "count":1,
        "p":[
          "If AFR is currently actually working (not just configured), this shall be expressed as an '1'."
        ]
      },
      {
        "id":"atpcIsUp",
        "count":1,
        "p":[
          "If ATPC is currently actually working (not just configured), this shall be expressed as an '1'."
        ]
      },
      {
        "id":"loopBackIsUp",
        "count":1,
        "p":[
          "If loop back of the air interface header is currently active (not just configured), this shall be expressed as an '1'."
        ]
      }
    ]
  }
}